/************************************************************************/
/*      Author:  Zhangzhe 
/*        Date:  14/10/2010
/*       Class:  TianChu
/* Description:  对线程API和函数进行面向对象封装，方法不限。
/*               要求：
/*               (1) 实现线程的创建，启动，挂起，回复，睡眠，设置优先级
/*					 等操作。                                                               
/************************************************************************/

#include "myThread.h"

int main()
{
	Thread* tp = new MyThread();
	tp->start();
	tp->stop();
	return 0;
}